IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MPU_SCRM2SCRP0_MPU_SCRM2SCRP0.xml
<module name="MPU_SCRM2SCRP0_MPU_SCRM2SCRP0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MPU_SCRM2SCRP0_REVISION" acronym="MPU_SCRM2SCRP0_REVISION" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme." range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Always read a s0. Writes have no affect." range="29 - 28" rwaccess="RO"/> 
		<bitfield id="MODID" width="12" begin="27" end="16" resetval="0x3713" description="Module ID field." range="27 - 16" rwaccess="RO"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x10" description="RTL revision.Will vary depending on release." range="15 - 11" rwaccess="RO"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Majo revision." range="10 - 8" rwaccess="RO"/> 
		<bitfield id="REVCUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x1" description="Minor revision." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_SCRM2SCRP0_CONFIGURATION" acronym="MPU_SCRM2SCRP0_CONFIGURATION" offset="0x4" width="32" description="">
		<bitfield id="ADDRESS_ALIGN" width="8" begin="31" end="24" resetval="0x0" description="Address alignment for range checking." range="31 - 24" rwaccess="RO"/> 
		<bitfield id="NUM_FIXED" width="4" begin="23" end="20" resetval="0x0" description="Number of fixed address ranges Configurable as 0 or 1." range="23 - 20" rwaccess="RO"/> 
		<bitfield id="NUM_PROG" width="4" begin="19" end="16" resetval="0x8" description="Number of programmable address ranges.Value is determined by configuration" range="19 - 16" rwaccess="RO"/> 
		<bitfield id="NUM_FIXED_AIDS" width="4" begin="15" end="12" resetval="0x0" description="Number of supported AIDs.0 = no specific AIDs supported (all treated equally)N = PrivIDs from 0 to N-1 supported, others use AIDX" range="15 - 12" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="11" begin="11" end="1" resetval="0x0" description="Always read as 0." range="11 - 1" rwaccess="RO"/> 
		<bitfield id="ASSUMED_ALLOWED" width="1" begin="0" end="0" resetval="0x0" description="Assumed allowed mode. 0 = assumed disallowed, 1 = assumed allowed" range="0" rwaccess="RO"/>
	</register>
	<register id="MPU_SCRM2SCRP0_INTERRUPT_RAW_STATUSSET" acronym="MPU_SCRM2SCRP0_INTERRUPT_RAW_STATUSSET" offset="0x10" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read.Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W1TOSET"/> 
		<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W1TOSET"/>
	</register>
	<register id="MPU_SCRM2SCRP0_INTERRUPT_ENABLED_STATUSCLEAR" acronym="MPU_SCRM2SCRP0_INTERRUPT_ENABLED_STATUSCLEAR" offset="0x14" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read.Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W0TOCLR"/> 
		<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W0TOCLR"/>
	</register>
	<register id="MPU_SCRM2SCRP0_INTERRUPT_ENABLE" acronym="MPU_SCRM2SCRP0_INTERRUPT_ENABLE" offset="0x18" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W1TOSET"/> 
		<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W1TOSET"/>
	</register>
	<register id="MPU_SCRM2SCRP0_INTERRUPT_ENABLE_CLEAR" acronym="MPU_SCRM2SCRP0_INTERRUPT_ENABLE_CLEAR" offset="0x1C" width="32" description="">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0." range="31 - 2" rwaccess="RO"/> 
		<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="RW
	  			 W0TOCLR"/> 
		<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="RW
	  			 W0TOCLR"/>
	</register>
	<register id="MPU_SCRM2SCRP0_EOI" acronym="MPU_SCRM2SCRP0_EOI" offset="0x20" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Always read as 0." range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value.Write this with the interrupt distribution value in the chip. This drives the mpu_eoi_vector output signal." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="MPU_SCRM2SCRP0_INTERRUPT_VECTOR" acronym="MPU_SCRM2SCRP0_INTERRUPT_VECTOR" offset="0x24" width="32" description="">
		<bitfield id="INTR_VEC" width="32" begin="31" end="0" resetval="0x0" description="Interrupt vector. Reads mpu_intr_vector input signal." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_SCRM2SCRP0_FIXED_START_ADDRESS" acronym="MPU_SCRM2SCRP0_FIXED_START_ADDRESS" offset="0x100" width="32" description="">
		<bitfield id="START_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="MPU_SCRM2SCRP0_FIXED_END_ADDRESS" acronym="MPU_SCRM2SCRP0_FIXED_END_ADDRESS" offset="0x104" width="32" description="">
		<bitfield id="END_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Reserved not used in Design" range="31 - 0" rwaccess="RO"/>
	</register>
